welcome_text = """
👋 Привет с VK Fest в Петербурге!
Ты попал в бот Robowizard — и сейчас увидишь, как роботы могут быть не только полезными, но и весёлыми 🤖
🎥 Наш робот-оператор Кинебот уже ждёт, чтобы снять с тобой крутое видео!
📩 После съёмки ты получишь крутой ролик прямо сюда — на память о фестивале и нашей встрече.

Готов блистать перед камерой?

Тогда вперёд! 🚀


Напиши, как тебя зовут, получи номер в очереди и подойди к оператору робота и следуй его подсказкам.
Всё остальное робот сделает сам 😉
"""

name_success_text = """
🎉 Отлично, {name}! Твой номер в очереди: {id}.
Подойди к оператору кинебота и следуй его подсказкам.
"""
name_already_exists_text = """
🚫 Ты уже зарегистрирован(а) в системе. Если хочешь повторить регистрацию, напиши /start.
"""

ask_subscription_text = """
🎬 Отлично, видео готово! Остался один шаг 👇
📲 Подпишись на наши каналы, чтобы получить ссылку:
✅ Как только подпишешься — пришлём видео прямо сюда!
"""

button_subscribe_1 = "Компания Робовизард"
url_subscribe_1 = "https://t.me/robotics_expert"
button_subscribe_2 = "ЛАЭС Инфо"
url_subscribe_2 = "https://t.me/laesinfo"
button_subscribe_3 = "Я подписался / Уже подписан"

not_subscribed_text = """
🚫 Ты не подписан на все необходимые каналы.
Пожалуйста, подпишись на них, чтобы получить доступ к видео.
"""

video_link_text = """
🎉 Спасибо! Вот твоё видео:
🔗 <a href="{video_link}">Смотреть видео</a>
⚠️ Ссылка будет действительна 7 дней, так что не забудь сохранить её заранее!
Спасибо, что заглянул(а) к нам на VK Fest — команда Robowizard рада знакомству 🤖
До встречи! 👋
"""

unknown_command_text = """
🚫 Неизвестная команда. Пожалуйста, используй /start для начала.
"""